{"name": "Isabel Wang", "email": "isabella930514@gmail.com", "mobile_number": "0210245433", "skills": ["Engagement", "Security", "Mathematics", "International", "Queries", "Architecture", "Transactions", "Python", "Oracle", "Html", "Programming", "Reports", "Logical", "Email", "Mining", "Css", "C", "Ai", "Operations", "Construction", "Data analysis", "Publishing", "Analyze", "Research", "Java", "Datasets", "Windows", "Visual", "Acquisition", "Travel", "Testing", "Ui", "System", "Statistics", "Ios", "Design", "Deep learning", "Javascript", "Parser", "Website", "Teaching", "Sql", "Database", "Mobile", "Analysis"], "college_name": null, "degree": ["Master of Computer and Information Sciences"], "designation": ["Team Leader", "Teaching Assistant"], "experience": ["R&D, Callaghan Innovation (Fellowship Grant)", "Aug 2021 - Present", "Project: Automated Completion and Adjustment for Knowledge Graph.", "1.", "2. Conduct in-depth research on knowledge graph extraction and construction.", "3. Create research reports and develop an up-to-date recommendation architecture and system.", "AI Engineer, Caito.AI (Contract)", "Aug 2021 - Present", "1. Conduct data matching, fusion, and recommendation-related works using deep learning models and knowledge", "graphs.", "2. Design and develop the seeker recommendation platform.", "Business Analysis Summer Intern, CAE", "Nov 2023 - Feb 2024", "1. Understand the inputs and outputs for the pairing and roster problems.", "2. Use Python to generate solution difference reports, containing information on how two solutions differ.", "3. Check the difference in outputs for multiple data sets with different inputs, and perform trend analysis via Python", "and Business Intelligence tools (Power BI).", "Tester, Auckland University of Technology", "Nov 2021 - Feb 2022", "Tested the mobile app ‘Canvas’ and taught students its usage.", "1.", "2. Assisted students in resolving queries related to Canvas.", "Teaching Assistant, Auckland University of Technology", "Mar 2019 - Present", "1. Conduct JAVA labs, guiding students through exercises.", "2.", "3.", "4.", "Led labs for Logical Database Design (Oracle SQL Server).", "Provide clear explanations of lab exercises.", "Supervise and assist students in completing labs and addressing queries.", "Research Assistant, Auckland University of Technology", "1. Contributed to the project “Vehicle Price Prediction”.", "Oct 2019 - Dec 2019", "Guest Lecturer, Auckland University of Technology", "Oct 2019 - Oct 2019", "Presented a professional lecture on Deep Learning Prediction.", "1.", "2. Benefited from interacting with students and sharing research insights.", "Project Experiences", "Workforce Recommendation System (Present)", "Role: Developer, Researcher, Team Member", "Techniques: Knowledge Graphs, Natural Language Processing, Machine Learning, Python", "Description: The main purpose is to recommend employees to the employer by considering requirements from both", "stakeholders. Included functions:", "1. A resume parser used for extracting information from resumes. 2. A web scrapper for scrapping jobs-related", "information from Indeed or LinkedIn (job title,", "job company, URL, skills, description). 3. Workforce", "recommendation (including knowledge graph extraction, augmentation, and prediction).", "Human Sentiment Analysis", "Year: 2023", "Role: Team Leader, Researcher, and Developer", "Techniques: Python, Knowledge Graph, Natural Language Processing (NLP), Mathematics, Neural Networks", "Description: Led the research and development of a Human Sentiment Analysis project. Leveraged Python,", "Knowledge Graph, and NLP to gather and analyze vast unstructured data, effectively distinguishing user sentiments.", "Implemented neural network models and mathematical analysis to extract valuable insights and discern user", "preferences, enhancing data-driven decision-making.", "Human Belief Networks Construction and Analysis", "Year: 2023", "Role: Team Leader, Researcher, and Developer", "Techniques: Python, Neural Networks, Knowledge Graph", "Description: Spearheaded the creation and analysis of Human Belief Networks. Utilized Python and Neural", "Networks to construct comprehensive user interest graphs from real-world text-structured datasets. Devised", "visualizations of graph-based user beliefs, facilitating efficient search, analysis, and comprehension. Contributed to", "groundbreaking insights into user behavior and preferences.", "User-based Recommendation System", "Year: 2022", "Role: Researcher and Developer", "Techniques: Python, Neural Networks, Knowledge Graph", "Description: Innovated a Recommendation System, driving data-driven personalization. Employed Python, Neural"], "company_names": null, "no_of_pages": 3, "total_experience": 10.83, "linkedin": null}